/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package bmi_for_you;

import com.sun.org.apache.xalan.internal.xsltc.compiler.util.Type;

/**
 *
 * @author NUT
 */
public class table_food extends javax.swing.JInternalFrame {
    private String HS[] ={"ประเภท","กิจกรรมการออกกำลังกาย / 1 ชั่วโมง","เผาผลาญ/กิโลแคลอรี่"};
    private String H[] ={"ประเภท","อาหาร","กิโลแคลอรี่"};
    private String f = "อาหารจานเดียว/กับข้าว";
    private String food[][] ={{f,"กระเพราปลา 1 ชาม","150"},{f,"กระเพราปลาตุ๋นน้ำแดง","225"},
        {f,"กุนเชียงทอด 1 คู่เล็ก","240"},{f,"กุ้งทอดกระเทียมพริกไทย 3 ตัวกลาง","259"},
        {f,"กุ้งนางนึ่งนมสด 1 ถ้วย","185"},{f,"กุ้งผัดพริกอ่อน 1 จาน","235"},
        {f,"กุ้งอบวุ้นเส้น 1 จาน","300"},{f,"ก๋วยจั๊บ 1 ชาม","240"},
        {f,"ก๋วยจั๊บญวณ 1 ถ้วย","235"},{f,"ก๋วยเตี๋ยวคั่วไก่ 1 จาน","435"},
        {f,"ก๋วยเตี๋ยวต้มยำกุ้ง 1 ถ้วย","320"},{f,"ก๋วยเตี๋ยวผัดกระเพราไก่ 1 จาน","440"}
       ,{f,"ก๋วยเตี๋ยวผัดไทยกุ้งสดใส่ไข่ 1 จาน","545"},{f,"ก๋วยเตี๋ยวราดหน้าปลากระพง 1 จาน","435"},
       {f,"ก๋วยเตี๋ยวหลอด 1 จาน","225"},{f,"ก๋วยเตี๋ยวเนื้อสับ 1 จาน","370"},
       {f,"ก๋วยเตี๋ยวเนื้อเรียง 1 ถ้วย","370"},{f,"ก๋วยเตี๋ยวเรือน้ำตกน้ำ 1 ถ้วย","180"},
       {f,"ก๋วยเตี๋ยวเรือน้ำตกแห้ง 1 ถ้วย","225"},{f,"ก๋วยเตี๋ยวเส้นปลา น้ำ 1 ชาม","375"},
       {f,"ก๋วยเตี๋ยวเส้นปลา แห้ง 1 ชาม","420"},{f,"ก๋วยเตี๋ยวเส้นเล็กต้มยำหมู 1 ชาม","335"},
       {f,"ก๋วยเตี๋ยวเส้นเล็กหมูแห้ง 1 ชาม","330"},{f,"ก๋วยเตี๋ยวเส้นใหญ่ผัดซีอิ๊วใส่ไข่ 1 จาน","520"}
            ,{f,"ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู 1 จาน","405"},{f,"ก๋วยเตี๋ยวแขก 1 ถ้วย","380"},
            {f,"ขนมจีน (50 กรัม) 1 จับ","50"},{f,"ขนมจีน 2 ทัพพี","160"},
            {f,"ขนมจีนซาวน้ำ 1 จาน","320"},{f,"ขนมจีนน้ำพริก 1 จาน","450"},
            {f,"ขนมจีนน้ำยา 1 จาน","370"},{f,"ขนมจีนน้ำเงี้ยว 1 ถ้วย","305"},
            {f,"ขนมหัวผักกาดผัด 1 จาน","560"},{f,"ขนมหัวผักกาดผัด ใส่ไข่ 1 จาน","630"},
            {f,"ข้าว สตูว์ไก่ 1 จาน","465"},{f,"ข้าวกุ้งทอดกระเทียมพริกไทย 1 จาน","495"},
            {f,"ข้าวขาหมู 1 จาน","690"},{f,"ข้าวคลุกกะปิ 1 จาน","410"},
            {f,"ข้าวซอยไก่, หมู 1 ถ้วย","385"},{f,"ข้าวญี่ปุ่น 3 ช้อนโต๊ะ 70 กรัม 1 ทัพพี","118"},
            {f,"ข้าวต้ม(ข้าวกล้อง) 1 ถ้วย","120"},{f,"ข้าวต้ม(ข้าวขาว) 1 ถ้วย","120"},
            {f,"ข้าวปุ้น (ส้มตำ - ขนมจีน) 1 จาน","180"},{f,"ข้าวผัดกระเพรากุ้ง 1 จาน","540"},
            {f,"ข้าวผัดกระเพราหมู 1 จาน","580"},{f,"ข้าวผัดกระเพราไก่ไข่ดาว 1 จาน","630"},
            {f,"ข้าวผัดกุนเชียง 1 จาน","590"},{f,"ข้าวผัดกุ้งใส่ไข่ 1 จาน","595"},
            {f,"ข้าวผัดคะน้าหมูกรอบ 1 จาน","670"},{f,"ข้าวผัดต้มยำทะเลแห้ง 1 จาน","400"},
            {f,"ข้าวผัดน้ำพริกกุ้งสด 1 จาน","460"},{f,"ข้าวผัดน้ำพริกลงเรือ 1 จาน","605"},
            {f,"ข้าวผัดปลาหมึกน้ำพริกเผา 1 จาน","535"},{f,"ข้าวผัดปลาเค็ม 1 จาน","405"},
            {f,"ข้าวผัดปูใส่ไข่ 1 จาน","610"},{f,"ข้าวผัดผักกระเฉดหมูกรอบ 1 จาน","600"},
            {f,"ข้าวผัดมันกุ้งใส่ไข่ 1 จาน","575"},{f,"ข้าวผัดสับปะรด 1 จาน","335"},
            {f,"ข้าวผัดหนำเลียบ-หมู-ไข่ 1 จาน","370"},{f,"ข้าวผัดหมูน้ำพริกเผา 1 จาน","665"},
            {f,"ข้าวผัดหมูใส่ไข่ 1 จาน","660"},{f,"ข้าวผัดอเมริกัน 1 จาน","790"},
            {f,"ข้าวผัดแกงเขียวหวานไก่ 1 จาน","630"},{f,"ข้าวผัดแหนม 1 จาน","610"},
            {f,"ข้าวผัดไส้กรอก 1 จาน","520"},{f,"ข้าวมันส้มตำ เนื้อผัดหวาน 1 จาน","590"},
            {f,"ข้าวมันไก่ 1 จาน","585"},{f,"ข้าวมันไก่ทอด 1 จาน","695"},
            {f,"ข้าวยำปักษ์ใต้ 1 จาน","180"},
            {f,"ข้าวราดหน้าไก่ 1 จาน","400"},{f,"ข้าวสวย(ข้าวกล้อง) 3 ทัพพี","240"},
            {f,"ข้าวสวย(ข้าวขาว) 3 ทัพพี","240"},{f,"ข้าวหน้ากุ้งผัดพริดสด 1 จาน","540"},
            {f,"ข้าวหน้าเป็ด 1 จาน","495"},{f,"ข้าวหมกไก่ 1 จาน","540"},
            {f,"ข้าวหมูกระเทียม 1 จาน","525"},{f,"ข้าวหมูแดง 1 จาน","560"},
            {f,"ข้าวอบเผือก 1 จาน","385"},{f,"ข้าวเหนียวนึ่ง 1-2 ทัพพี","80"},
            {f,"ข้าวเหนียวหมูทอด 1 ชุด","440"},{f,"ข้าวเหนียวหมูสวรรค์ 1 ชุด","480"},
            {f,"ข้าวแช่ 1 ชุด","350"},{f,"ข้าวไก่อบ 1 จาน","490"},{f,"ข้าวไข่เจียว 1 จาน","445"},
            {f,"คอหมูย่าง 1 จาน","200"},{f,"คะน้าหมูกรอบ 1 จาน","420"},
            {f,"ซุปข้าวโพด 1 ถ้วย","140"},{f,"ซุปหน่อไม้ 1 จาน","40"},
            {f,"ซุปใส (ผัก) 1 ถ้วย","15"},{f,"ตับไก่ปิ้ง 1 ไม้","60"},
            {f,"ต้มกะทิสายบัว ปลาทูนึ่ง 1 ถ้วย","225"},{f,"ต้มข่าไก่ 1 ถ้วย","210"},{f,"ต้มจับฉ่าย 1 ถ้วย","180"}
            ,{f,"ต้มตือฮวน 1 ถ้วย","160"},{f,"ต้มผักกาดดอง ซี่โครงหมู 1 ถ้วย","90"},{f,"ต้มยำกุ้ง 1 ถ้วย","65"},
            {f,"ต้มยำปลากระป๋อง 1 ถ้วย","55"},{f,"ต้มยำปลากระพง 1 ถ้วย","80"},{f,"ต้มยำเห็ดสด 1 ถ้วย","30"},
            {f,"ต้มยำไก่-ใส่เห็ด 1 ถ้วย","80"},{f,"ต้มส้มปลาทู 1 ถ้วย","130"},{f,"ต้มหัวผักกาดขาว ซี่โครงหมู 1 ถ้วย","90"},
            {f,"ต้มเลือดหมู","120"},{f,"ต้มโคล้งปลากรอบ 1 ถ้วย","60"},{f,"ต้มโคล้งไก่ย่าง 1 ถ้วย","115"},
            {f,"ทอดมันกุ้ง 1 จาน","255"},{f,"ทอดมันปลากราย 1 ชิ้น","230"},
            {f,"น้ำพริกกะปิผักสด 2 ช้อนโต๊ะ","55"},{f,"น้ำพริกปลาป่น 1 ถ้วย","35"},
            {f,"น้ำพริกมะขามสด 1 ถ้วย","210"},{f,"น้ำพริกมะขามเปียก 1 ถ้วย","55"},
            {f,"น้ำพริกมะม่วง 1 ถ้วย","100"},{f,"น้ำพริกลงเรือ 1 ถ้วย","195"},
            {f,"น้ำพริกหนุ่ม 2 ช้อนโต๊ะ","35"},{f,"น้ำพริกอ่อง 2 ช้อนโต๊ะ","160"},
            {f,"บะหมี่กรอบราดหน้า 1 จาน","515"},{f,"บะหมี่กรอบราดหน้า รวมมิตร 1 จาน","690"},
            {f,"บะหมี่กรอบราดหน้า ไก่ หน่อไม้ 1 จาน","660"},{f,"บะหมี่กึ่งสำเร็จรูปผัดกระเพราหมู 1 จาน","540"},
            {f,"บะหมี่กึ่งสำเร็จรูปผัดขี้เมา 1 จาน","530"},{f,"บะหมี่น่องไก่-น้ำ 1 ชาม","375"},{f,"บะหมี่น้ำต้มยำ หมู 1 ถ้วย","300"},
            {f,"บะหมี่เกี๊ยวหมูแดง-น้ำ 1 ชาม","305"},{f,"บะหมี่เกี๊ยวเป็ดย่าง 1 ถ้วย","415"},{f,"บะหมี่เป็ดน้ำ 1 ถ้วย","370"},
            {f,"บะหมี่แห้ง หมูแดง 1 จาน","345"},{f,"บาร์บีคิวซี่โครงหมู ข้าวคลุกเนย 1 ชุด","340"},{f,"ปลากระพงนึ่งมะนาว 1 ชิ้นกลาง","155"},
            {f,"ปลาชุบขนมปังทอด สลัดผัก 1 จาน","595"},{f,"ปลาช่อนอบเกลือ 1 ตัว","220"},{f,"ปลาซาบะย่าง 1 ตัว","220"},
            {f,"ปลาดุกย่าง น้ำปลามะนาว 1 ตัวเล็ก","165"},{f,"ปลาทอดสามรส 1 ตัวกลาง","470"},{f,"ปลาทูทอด 1 ตัวกลาง","280"},
            {f,"ปลาราดซอสมะนาว มันฝรั่งทอด 1 จาน","560"},{f,"ปลาราดพริก 1 จาน","300"},{f,"ปลาร้าทรงเครื่อง 1 ถ้วย","155"},
            {f,"ปลาร้าสับ 1 ถ้วย","35"},{f,"ปลาสลิดทอด 1 ตัว","190"},{f,"ปลาสำลีแดดเดียว ยำมะม่วง ครึ่งตัวเล็ก","415"},
            {f,"ปลาหมึกนึ่งมะนาว 1 ,ตัว","75"},{f,"ปลาหมึกผัดฉ่า 1 ถ้วย","260"},{f,"ปลาอินทรีย์เค็มทอด 1 จาน","115"},
            {f,"ปลาเล็กปลาน้อยทอดกรอบ 1 ช้อนโต๊ะ","80"},{f,"ปลาแซลมอนย่าง 1 จาน","260"},
            {f,"ปีกไก่สอดไส้ทอด 3 ชุด","310"},{f,"ผัดกะหล่ำปลี หมู กุ้ง 1 จาน","230"},
            {f,"ผัดคะน้าปลาเค็ม 1 จาน","200"},{f,"ผัดดอกกะหล่ำกับกุ้ง 1 จาน","210"},
            {f,"ผัดดอกกุ่ยช่ายกับตับ 1 จาน","210"},{f,"ผัดถั่วงอกกับเต้าหู้ 1 จาน","155"},
            {f,"ผัดถั่วลันเตากับกุ้ง 1 จาน","190"},{f,"ผัดบร็อกโคลี่กับกุ้ง 1 จาน","210"},
            {f,"ผัดบวบใส่ไข่ 1 จาน","210"},{f,"ผัดผักกระเฉดน้ำมันหอย 1 จาน","185"},
            {f,"ผัดผักกาดขาวหมู วุ้นเส้น 1 จาน","230"},{f,"ผัดผักกาดดองใส่ไข่ 1 จาน","205"},
            {f,"ผัดผักบุ้งไฟแดง 1 จาน","210"},{f,"ผัดผักรวมกับหมู 1 จาน","210"},
            {f,"ผัดพริกขิงกุ้งกับถั่วฝักยาว 1 ถ้วย","245"},{f,"ผัดพริกขิงหมูกับถั่วฝักยาว 1 จาน","265"},
            {f,"ผัดพริกแกงหมูกับหน่อไม้ 1 ถ้วย","200"},{f,"ผัดฟักทองใส่ไข่ 1 จาน","255"},
            {f,"ผัดมะเขือยาวหมูสับ 1 จาน","210"},{f,"ผัดยอดมะระน้ำมันหอย 1 จาน","185"},
            {f,"ผัดวุ้นเส้นใส่ไข่ 1 จาน","265"},{f,"ผัดสะตอกับหมู กุ้ง 1 จาน","200"},
            {f,"ผัดหน่อไม้กับไข่ 1 จาน","200"},{f,"ผัดหน่อไม้ฝรั่งกับกุง 1 จาน","230"},
            {f,"ผัดเปรี้ยวหวานไก่ 1 จาน","215"},{f,"ผัดเผ็ดปลาดุก 1 ถ้วย","200"},
            {f,"ผัดเผ็ดปลาทอดกรอบ 1 ถ้วย","290"},{f,"ผัดเผ็ดหมูกับมะเขือ 1 จาน","250"},
            {f,"ผัดไชโป๊วใส่ไข่ 1 จาน","125"},{f,"ผัดไทยไข่ห่อ 1 จาน","565"},
            {f,"ผัดไทยไร้เส้น 1 จาน","350"},{f,"พอร์คชอปทอด ผักผัดเนย 1 จาน","545"},
            {f,"พะแนงไก่ 1 ถ้วย","230"},{f,"ฟักตุ๋นไก่มะนาวดอง 1 ถ้วย","125"},
            {f,"มักกะโรนีขี้เมาไก่ 1 จาน","520"},{f,"มักกะโรนีผัดกุ้ง 1 จาน","420"},
            {f,"ยากิโซบะ 1 จาน","400"},{f,"ยำกุนเชียง 1 จาน","220"},{f,"ยำขนมจีน 1 จาน","220"},
            {f,"ยำถั่วพู 1 จาน","185"},{f,"ยำบะหมี่กึ่งสำเร็จรูป 1 จาน","215"},{f,"ยำปลากระป๋อง 1 ถ้วย","55"},
            {f,"ยำปลาดุกฟู 1 จาน","275"},{f,"ยำผักกะเฉด 1 จาน","115"},{f,"ยำผักกาดดอง","35"},
            {f,"ยำผักบุ้งทอดกรอบ 1 จาน","310"},{f,"ยำมะเขือยาว 1 จาน","115"},{f,"ยำรวมมิตรทะเล 1 จาน","150"},
            {f,"ยำวุ้นเส้น 1 จาน","120"},{f,"ยำหนังหมู 1 จาน","220"},{f,"ยำหมูย่าง 1 จาน","165"},
            {f,"ยำเนื้อย่าง 1 จาน","165"},{f,"ยำไข่ต้ม 1 ฟอง","105"},{f,"ยำไส้กรอก 1 จาน","110"},
            {f,"ลาบไก่ 1 จาน","125"},{f,"ลูกชิ้นทอด 6 ลูก","210"},{f,"ลูกชิ้นปิ้ง 1 ไม้","165"},
            {f,"วุ้นเส้นผัดไทย กุ้งสด 1 จาน","520"},{f,"สปาเกตตี้กระเพรากุ้ง 1 จาน","485"},
            {f,"สปาเก็ตตี้ไก่อบ 1 จาน","430"},{f,"สลัดผัก 1 จาน","240"},{f,"สลัดเนื้อสันในทอด 1 จาน","490"},
            {f,"สลัดแขก 1 จาน","230"},{f,"สุกียากี้แห้งทะเล 1 ถ้วย","280"},{f,"สุกี้ยากี้ไก่-น้ำ 1 ชาม","345"},
            {f,"สเต็กปลาย่าง 1 จาน","260"},{f,"สเต็กหมู ผักสดคลุก 1 จาน","505"},{f,"สเต็กหมู สลัดผักสด 1 จาน","375"},
            {f,"สเต็กไก่ทอด มันบด 1 จาน","615"},{f,"ส้มตำปู 1 จาน","35"},{f,"ส้มตำไทย 1 จาน","690"},
            {f,"หมี่กรอบราดหน้าหมู 1 จาน","690"},{f,"หมี่กะทิ 1 จาน","405"},{f,"หมี่ซั่วผัด 1 จาน","395"},
            {f,"หมุย่างเกาหลี 1 ชุด","375"},{f,"หมูกรอบ 1 จาน","560"},{f,"หมูกะทะ 1 ชุด","375"},
            {f,"หมูคลุกเกร็ดขนมปังทอด ซอส 1 ชุด","645"},{f,"หมูจุ่ม 1 ชุด","375"},{f,"หมูทอดกระเทียมพริกไทย 3x5 นิ้ว","245"},
            {f,"หมูทอดเนย สลัดน้ำใส 1 จาน","635"},{f,"หมูน้ำตก 1 จาน","165"},{f,"หมูผัดขิง 1 จาน","275"},
            {f,"หมูฝอย 2 ช้อนโต๊ะ","135"},{f,"หมูยอชุบแป้งทอด 2 ชิ้น","250"},{f,"หมูหยอง 2 ช้อนโต๊ะ","75"},
            {f,"หมูแผ่น 1 แผ่นกลาง","120"},{f,"หลนปูเค็ม ผักสด 1 ถ้วย","205"},{f,"หอยแมลงภู่ทอด 1 จาน","605"},
            {f,"หอยแมลงภู่อบหม้อดิน 4-5 ตัว","85"},{f,"เกาเหลาลูกชิ้นน้ำใส 1 ถ้วย","225"},{f,"เกี๊ยวกรอบราดหน้ากุ้ง 1 จาน","635"},
            {f,"เกี๊ยวน้ำกุ้ง 1 ชาม","275"},{f,"เนื้อน้ำตก 1 จาน","165"},{f,"เนื้อเค็มทอด 3x5 นิ้ว","280"},
            {f,"เป็ดตุ๋น มะนาวดอง 1 ถ้วย","110"},{f,"เกี๊ยวปลาน้ำ 1 ถ้วย","165"},{f,"เครื่องในไก่ผัดขิง 1 จาน","200"},
            {f,"เทมปุระ 3 ชิ้น","250"},{f,"เป็ดพะโล้ 1 ถ้วย","110"},{f,"เฝอ 1 ถ้วย","240"},{f,"เย็นตาโฟน้ำ 1 ชาม","290"},
            {f,"เส้นจันท์ผัดปู 1 จาน","575"},{f,"เส้นหมี่ลูกชิ้นน้ำใส 1 ชาม","225"},{f,"เส้นหมี่ลูกชิ้นหมูแห้ง 1 ถ้วย","430"},
            {f,"เส้นใหญ่ผัดขี้เมา","550"},{f,"แกงกะหรี่หมู 1 ถ้วย","325"},{f,"แกงกะหรี่ไก่ 1 ถ้วย","450"},{f,"แกงขี้เหล็ก 1 ถ้วย","195"},
            {f,"แกงขี้เหล็กหมูย่าง 1 ถ้วย","245"},{f,"แกงจืดตำลึงหมูสับ 1 ถ้วย","90"},{f,"แกงจืดถั่วงอกหมูสับ 1 ถ้วย","50"},
            {f,"แกงจืดฟักยัดไส้ 1 ถ้วย","90"},{f,"แกงจืดวุ้นเส้น 1 ถ้วย","115"},{f,"แกงจืดเต้าหู้ยัดไส้ 1 ถ้วย","110"},
            {f,"แกงจืดเต้าหู้หมูสับ 1 ถ้วย","80"},{f,"แกงจืดไข่เจียว 1 ถ้วย (ไข่ 1 ฟอง)","220"},{f,"แกงป่าไก่ 1 ถ้วย","130"},
            {f,"แกงมัสมั่นไก่ 1 ถ้วย","325"},{f,"แกงส้มชะอมชุบไข่ทอดกับกุ้ง 1 ถ้วย","270"},{f,"แกงส้มดอกแคกับกุ้ง 1 ถ้วย","105"},
            {f,"แกงส้มปลาแปะซะ 1 ถ้วย","160"},{f,"แกงส้มผักกะเฉด-ปลา 1 ชาม","110"},{f,"แกงส้มผักบุ้ง ปลาช่อน 1 ถ้วย","105"},
            {f,"แกงส้มผักรวม 1 ถ้วย","120"},{f,"แกงส้มผักรวมกุ้ง 1 ถ้วย","105"},{f,"แกงหมูเทโพ 1 ถ้วย","300"},
            {f,"แกงเขียวหวานปลาดุก 1 ถ้วย","235"},{f,"แกงเขียวหวานลูกชิ้นปลากราย 1 ถ้วย","240"},{f,"แกงเขียวหวานหมู 1 ถ้วย","235"},
            {f,"แกงเขียวหวานไก่ 1 ถ้วย","240"},{f,"แกงเผ็ดฟักทอง ใส่หมู 1 ถ้วย","250"},{f,"แกงเผ็ดลูกชิ้นปลา 1 ถ้วย","240"},
            {f,"แกงเผ็ดหมูยอดมะพร้าว 1 ถ้วย","245"},{f,"แกงเผ็ดเป็ดย่าง 1 ถ้วย","240"},{f,"แกงเผ็ดไก่ใส่มะเขือ 1 ถ้วย","235"},
            {f,"แกงเผ็ดไก่ใส่หน่อไม้ 1 ถ้วย","245"},{f,"แกงเลียง 1 ชาม","115"},{f,"แกงเหลืองมะละกอกับกุ้ง 1 ถ้วย","80"},
            {f,"แกงเหลืองหน่อไม้ดองกับปลา 1 ถ้วย","80"},{f,"แกงไตปลา 1 ถ้วย","50"},{f,"แคบหมู มีมัน 5 ชิ้นเล็ก","65"},
            {f,"แคบหมูไร้มัน 5 ชิ้นเล็ก","50"},{f,"แจ่วบอง 1 ถ้วย","25"},{f,"แหนมสด 1 จาน","175"},{f,"โกยซีหมี่ 1 จาน","550"},
            {f,"โจ๊กหมู 1 ถ้วย","160"},{f,"โจ๊กหมู ตับ ไข่ลวก 1 ถ้วย","230"},{f,"โรตีแกงเนื้อ, หมู 1 ชุด","675"},{f,"ไก่ตุ๋นมะนาวดอง 1 ถ้วย","110"},
            {f,"ไก่ทอด 1 น่อง","345"},{f,"ไก่ผัดขิง 1 จาน","210"},{f,"ไก่ย่าง 1 น่อง","165"},{f,"ไข่ดาว 1 ฟอง","165"},{f,"ไข่ดาวทรงเครื่อง 1 จาน","250"},
            {f,"ไข่ตุ๋น 1 ฟอง","75"},{f,"ไข่ต้ม น้ำปลามะนาว 1 ฟอง","75"},{f,"ไข่พะโล้ 1 ถ้วย","180"},{f,"ไข่ยัดไส้ 1 จาน","310"},{f,"ไข่ลวก 1 ฟอง","75"},
            {f,"ไข่ลูกเขย 1 ฟอง","205"},{f,"ไข่เค็ม 1 ฟอง","75"},{f,"ไข่เจียว 1 ฟอง","200"},{f,"ไข่เจียวหมูสับ 1 ฟอง","250"},{f,"ไส้กรอกเนื้อลูกวัวอบ สลัดผัก 1 จาน","465"},{f,"ไส้อั่ว 4 ชิ้นพอคำ","240"}};
    private String s = "ขนมหวาน/ของหวาน";
    private String dessert[][] ={{s,"กระทงทอง ไส้ไก่ ซอสขาว 3 ชิ้น","280"},{s,"กระทงทองไส้ข้าวโพด 3 ชิ้น","215"},{s,"กระท้อนทรงเครื่อง 1 ผล","205"},
        {s,"กระยาสารท 1x3 นิ้ว","210"},{s,"กล้วยคลุกมะพร้าว 1 ถ้วย","100"},{s,"กล้วยฉาบ 9 ชิ้น","200"},{s,"กล้วยต้มจิ้มมะพร้าว 1 จาน(2ผล)","180"},
        {s,"กล้วยน้ำว้าปิ้ง 1 ผล","90"},{s,"กล้วยบวชชี 1 ถ้วย","230"},{s,"กล้วยปิ้งชุบกะทิ 1 ผล","145"},{s,"กล้วยแขก 3 ชิ้น","255"},{s,"กล้วยไข่เชื่อม 1 จาน(2ผล)","177"},
        {s,"กะละแม 3 ห่อเล็ก","195"},{s,"กะหรี่พัฟ 2 ชิ้น","380"},{s,"กุ่ยช่าย(นึ่ง) 1 อัน","140"},{s,"ขนมกรวย 3 กรวย","190"},{s,"ขนมกล้วย 2 ห่อ","240"},
        {s,"ขนมขี้หนู 1 ถ้วย","165"},{s,"ขนมครก 2 คู่","210"},{s,"ขนมจีบ 3 ลูก","120"},{s,"ขนมชั้น 2 ชิ้น","184"},{s,"ขนมตาล 2 กระทง","115"},
        {s,"ขนมต้มขาว 4 ลูก","165"},{s,"ขนมถั่วแปป 1 จาน(3ตัว)","43"},{s,"ขนมถ้วย 2 ถ้วย","265"},{s,"ขนมน้ำดอกไม้ 1 จาน(9ชิ้น)","190"},
        {s,"ขนมบ้าบิ่น 1 ชิ้น","130"},{s,"ขนมปลากริมไข่เต่า 1 ถ้วย","250"},{s,"ขนมปังกระเทียม 2 ชิ้น","170"},{s,"ขนมปังขาไก่ 1 ชิ้น","65"},
        {s,"ขนมปังน้ำสลัดหมูหยอง 1 ชิ้น","230"},{s,"ขนมปังปอนด์ 1 แผ่น","80"},{s,"ขนมปังมะพร้าว 1 ชิ้น","235"},{s,"ขนมปังสังขยา 1 ชิ้น","230"},
        {s,"ขนมปังอบกรอบ 4 แผ่นเล็ก","80"},{s,"ขนมปังฮาวายเอี้ยน 1 ชิ้น","300"},{s,"ขนมปังไส้กรอก 1 ชิ้น","130"},{s,"ขนมปังไส้หมูหยอง 1 ชิ้น","185"},
        {s,"ขนมปังไส้ไก่ 1 ชิ้น","223"},{s,"ขนมฝักบัว 2 ชิ้น","140"},{s,"ขนมสอดไส้ 3 ห่อเล็ก","380"},{s,"ขนมหม้อแกง 1 ชิ้น","179"},
        {s,"ขนมเข่ง 1 กระทง","120"},{s,"ขนมเทียน 2 อัน","205"},{s,"ขนมเบื้องญวณ 1 แผ่น","280"},{s,"ขนมเบื้องไทยไส้หวาน 1 แผ่น","60"},
        {s,"ขนมเบื้องไทยไส้เค็ม 1 แผ่น","50"},{s,"ขนมเปียกปูน 1 ชิ้น","95"},{s,"ขนมเปี๊ยะไส้ถั่ว 2 ชิ้น","300"},{s,"ขนมเล็บมือนาง 1 จานเล็ก","27"},
        {s,"ขนมไหว้พระจันทร์ไส้ทุเรียนกวน 1 ชิ้น","340"},{s,"ขนมไหว้พระจันทร์ไส้ลูกบัว-ไข่เค็ม 1 ชิ้น","375"},{s,"ข้าวตังหน้าตั้ง 3 ชิ้น","280"},
        {s,"ข้าวตังหมูหยอง 2 แผ่น","160"},{s,"ข้าวต้มมัด 1 มัด","285"},{s,"ข้าวหลาม 1 กระบอก","230"},{s,"ข้าวเกรียบกุ้ง 3 แผ่น","110"},
        {s,"ข้าวเกรียบปากหม้อ 4 ชิ้น","205"},{s,"ข้าวเม่าทอด 2 ลูก","418"},{s,"ข้าวเหนียวกะทิทุเรียน 1 ถ้วย","225"},{s,"ข้าวเหนียวดำเปียก 1 ถ้วย","205"},
        {s,"ข้าวเหนียวตัด 1 ชิ้น","210"},{s,"ข้าวเหนียวมูลน้ำกะทิ 1 ชิ้นเล็ก","197"},{s,"ข้าวเหนียวสังขยา 1 ห่อ","370"},{s,"ข้าวเหนียวหน้ากุ้ง 1 ห่อ","179"},
        {s,"ข้าวแตน (ข้าวพองราดน้ำตาล) 1 แผ่น","150"},{s,"ข้าวโพดคลุก 1 จานเล็ก","156"},{s,"ข้าวโพดคั่ว (เคลือบน้ำตาล) 1 ถ้วย","60"},
        {s,"ข้าวโพดต้ม 1 ฝักเล็ก","200"},{s,"ครองแครง 22 ตัว","425"},{s,"ครองแครงกะทิ 1 ถ้วย","250"},{s,"ครีมโรล 1 ชิ้น","360"},
        {s,"คัสตาร์ดน้ำตาลไหม้ 1 ชิ้น","230"},{s,"คุ้กกี้ข้าวโอ๊ต 2 ชิ้น","150"},{s,"คุ้กกี้ชาเขียว 1 ชิ้น","150"},{s,"คุ้กกี้ช็อคโกแลตชิพ 2 ชิ้น","235"},
        {s,"คุ้กกี้สิงคโปร์ 2 ชิ้น","190"},{s,"คุ้กกี้เนย 2 ชิ้น","210"},{s,"คุ้กกี้ไส้สับปะรด 1 ชิ้น","190"},{s,"จาวตาลเชื่อม 1 ลูก","190"},
        {s,"ชิฟฟอนกาแฟ 1 ชิ้น","190"},{s,"ชิฟฟอนคัสตาร์ดเค้ก 1 ชิ้น","340"},{s,"ช็อคโกแลต 1 ชิ้นพอคำ","170"},{s,"ซาลาเปาไส้หมู 1 ลูก","120"},
        {s,"ซ่าหริ่ม 1 ถ้วย","275"},{s,"ตะโก้แห้ว 3 กระทงเล็ก","235"},{s,"ถั่วลิสงต้ม 1 ช้อนโต๊ะ","45"},{s,"ถั่วลิสงแผ่นทอด 1 แผ่น","150"},
        {s,"ถั่วเขียวต้มน้ำตาล 1 ถ้วย","160"},{s,"ถั่วแระต้ม 1 ช้อนโต๊ะ","25"},{s,"ทองม้วน 3 อันเล็ก","105"},{s,"ทองหยิบ 2 ดอก","210"},
        {s,"ทับทิมกรอบ 1 ถ้วย","250"},{s,"ทุเรียนกวน 1 ช้อนโต๊ะ","115"},{s,"ทุเรียนทอดกรอบ 7-8 ชิ้น","50"},{s,"ท๊อฟฟี่นม 1 เม็ด","20"},
        {s,"บราวนี่ 1 ชิ้น","340"},{s,"บะจ่าง 1 ลูก","300"},{s,"บัวลอย 1 ถ้วย","223"},{s,"บัวลอยน้ำขิง 1 ถ้วย","160"},
        {s,"บัวลอยเผือก 1 ถ้วย","300"},{s,"บูลเบอร์รี่ชีสเค้ก 1 ชิ้น","285"},{s,"ปอเปี๊ยะทอด 2 ชิ้น","315"},{s,"ปอเปี๊ยะสด 1 ชิ้น","175"},
        {s,"ปาท่องโก๋ 1 คู่กลาง","270"},{s,"ป๊อปคอร์น 1 ถ้วย","65"},{s,"ฝอยทอง 1 แพ","146"},{s,"พายกรอบ (โรยน้ำตาล) 2 ชิ้น","235"},
        {s,"พายชีสบูลเบอร์รี่ 1 ชิ้น","350"},{s,"พายทูน่า 1 ชิ้น","280"},{s,"พายสับปะรด 1 ชิ้น","505"},{s,"พายเผือก 1 ชิ้น","425"},
        {s,"พายไส้กรอก 1 ชิ้น","400"},{s,"พายไส้แฮม 1 ชิ้น","405"},{s,"พายไส้ไก่ 1 ชิ้น","405"},{s,"พิซซ่าขอบไส้กรอกชีส 1 ชิ้น","340"},
        {s,"พิซซ่าทะเล 1 ชิ้น","335"},{s,"พิซซ่าฮาวายเอี้ยน 1 ชิ้น","345"},{s,"พิซซ่าไส้กรอก 1 ชิ้น","290"},{s,"ฟรุตสลัด 1 ถ้วย","180"},
        {s,"ฟรุตเค้ก 1 ชิ้น","400"},{s,"ฟรุ้ตบาร์ 1 ชิ้น","305"},{s,"ฟักทองนึ่งโรยมะพร้าว 1 จานเล็ก","188"},{s,"ฟักทองเชื่อม 1 จานเล็ก","167"},
        {s,"ฟักทองแกงบวด 1 ถ้วย","185"},{s,"มะกอกทรงเครื่อง 5 ผล","165"},{s,"มะกอกแช่อิ่ม 5 ผล","135"},{s,"มะขามคลุก 6 เม็ด","10"},
        {s,"มะดันแช่อิ่ม 1 ผล","60"},{s,"มะม่วงน้ำปลาหวาน 5 ชิ้น","165"},{s,"มะยมหยี 5 เม็ด","135"},{s,"มะยมเชื่อม 5 เม็ด","135"},
        {s,"มันทอด 2 ชิ้น","248"},{s,"มันฝรั่งแผ่นทอด (Chip) 6 ชิ้น","80"},{s,"มันรังนก 2 ก้อน","95"},{s,"มันสำปะหลังปิ้งชุบกะทิ 1 ชิ้น","165"},
        {s,"มันเทศเชื่อม 1 จานเล็ก","230"},{s,"มันแกงบวด 1 ถ้วย","184"},{s,"รวมมิตร 1 ถ้วย","230"},{s,"ลอดช่องน้ำกะทิ 1 ถ้วย","210"},
        {s,"ลอดช่องสิงคโปร์ 1 ถ้วย","215"},{s,"ลำใยในน้ำเชื่อม 1 ถ้วย","180"},{s,"ลิ้นจี่ในน้ำเชื่อม 1 ถ้วย","110"},{s,"ลูกชิ้นปิ้ง 1 ไม้","165"},
        {s,"ลูกชุบ 3 ชิ้น","170"},{s,"ลูกตาลลอยแก้ว 1 ถ้วย","180"},{s,"ลูกเดือยต้มน้ำตาล 1 ถ้วย","140"},{s,"วุ้นกะทิ 1 ชิ้น","215"},
        {s,"วุ้นมะพร้าวอ่อน 1 ชิ้น","80"},{s,"สังขยา 1 ชิ้นเล็ก","204"},{s,"สังขยาฟักทอง 1 ชิ้นเล็ก","288"},{s,"สังขยาเผือก 1 ชิ้นเล็ก","222"},
        {s,"สาคูบัวลอย 1 ถ้วย","162"},{s,"สาคูเปียกรวมมิตร 1 ถ้วย","170"},{s,"สาคูไส้หมู 4 ลูก","205"},{s,"สาลี่ 1 ชิ้น","116"},
        {s,"สาเกเชื่อมราดกะทิ 1 ชิ้น","235"},{s,"หมูปิ้ง 2 ไม้","150"},{s,"หมูสะเต๊ะ 2 ไม้","230"},{s,"อัลมอนต์อบเกลือ 1 ช้อนโต๊ะ","45"},
        {s,"อาลัว 4 ชิ้น","145"},{s,"เกี๊ยวกรอบ 3 ชิ้น","235"},{s,"เกี๊ยวซ่า 3 ชิ้น","190"},{s,"เค้กกล้วยตาก 1 ชิ้น","305"},
        {s,"เค้กกล้วยหอม 1 ชิ้น","370"},{s,"เค้กช็อคโกแลต 1 ชิ้น","275"},{s,"เค้กเนย 1 ชิ้น","255"},{s,"อัพไซด์ดาวน์เค้ก 1 ชิ้น","395"},
        {s,"เค้กเนยแต่งหน้า 1 ชิ้น","405"},{s,"เค้กใบเตย 1 ชิ้น","250"},{s,"เฉาก๊วย 1 ถ้วย","90"},{s,"เดนิสแฮม 1 ชิ้น","385"},
        {s,"เต้าส่วน 1 ถ้วย","215"},{s,"เต้าหู้ทอด 3 ชิ้น","260"},{s,"เต้าหู้นมสด 1 ถ้วย","150"},{s,"เต้าฮวยน้ำขิง 1 ถ้วย","130"},
        {s,"เต้าฮวยฟรุตสลัด 1 ถ้วย","150"},{s,"เผือกน้ำกะทิ 1 ถ้วย","250"},{s,"เผือกสอดไส้ทอด 1 ชิ้น","260"},{s,"เผือกเชื่อม 1 จานเล็ก","220"},
        {s,"เฟรนฟรายด์ (French Fried) 6 ชิ้น","220"},{s,"เมล็ดทานตะวันอบกรอบ 1 ช้อนโต๊ะ","45"},{s,"เมล็ดฟักทองอบกรอบ 1 ช้อนโต๊ะ","55"},
        {s,"เมล็ดแตงโมแห้ง 1 ช้อนโต๊ะ","45"},{s,"เมี่ยงก๋วยเตี๋ยว 3 คำ","60"},{s,"เมี่ยงคะน้า 3 คำ","60"},{s,"เมี่ยงคำ 3 คำ","90"},{s,"เม็ดขนุน 5 เม็ด","174"},
        {s,"เม็ดมะม่วงหิมพานต์อบเนย 8-10 เม็ด","110"},{s,"เยลลี่ถ้วย 2 ถ้วย","80"},{s,"เอแคร์ไส้ครีม 1 ชิ้น","225"},{s,"แซนวิชทูน่า 1 คู่","180"},
        {s,"แซนวิชแฮม ชีส 1 คู่","290"},{s,"แซนวิชไก่ 1 คู่","240"},{s,"แบล็กฟลอเรสต์เค้ก 1 ชิ้น","470"},{s,"แมงลักน้ำกะทิ 1 ถ้วย","112"},
        {s,"แยมโรล 1 ชิ้น","310"},{s,"แหนมสด ข้าวทอด 1 จาน","290"},{s,"แฮมเบอร์เกอร์ชีส ไก่ 1 ชิ้น","280"},{s,"แฮมเบอร์เกอร์ชีสไก่ 1 ชิ้น","280"},
        {s,"แฮมเบอร์เกอร์หมู 1 ชิ้น","245"},{s,"โก๋แก่รสต่าง ๆ 15 เม็ด","55"},{s,"โดนัท แยม น้ำตาล 1 ชิ้น","270"},{s,"โดนัทยีสต์ 1 ชิ้น","250"},
        {s,"โรตี (ใส่นมข้น+น้ำตาล+ใส่ไข่)","590"},{s,"โรตีสายไหม 1 อัน","145"},{s,"ไก่ทอด 1 น่อง","345"},{s,"ไก่ย่าง 1 น่อง","165"},
        {s,"ไข่นกกระทา 11 ใบ","191"},{s,"ไข่หงส์ 3 ใบ","174"},{s,"ไส้กรอกทอด 1 ชิ้น","280"},{s,"ไส้กรอกอีสาน 1 อัน","90"},{s,"ไอศกรีมกะทิ 2 ก้อน","215"},
        {s,"ไอศกรีมกาแฟ 1 ก้อน","142"},{s,"ไอศกรีมชอกโกแล็ต 1 ก้อน","110"},{s,"ไอศกรีมวนิลลา 1 ก้อน","140"},{s,"ไอศกรีมสตรอเบอรี่ 1 ก้อน","110"},
        {s,"ไอศกรีมเรซิน 1 ก้อน","264"}};
    private String a = "ผลไม้";
    private String fruit[][] ={{a,"กล้วยตาก 1/2 ผล","60"},{a,"กล้วยน้ำว้า 1 ผล","60"},{a,"กล้วยหอม 1 ผล","120"},{a,"กล้วยเล็บมือนาง 2 ผล","60"},
        {a,"กล้วยไข่ 1 ผล","60"},{a,"ขนุน 2 ยวง","60"},{a,"ชมพู่ 2-3 ผล","60"},{a,"ชมพู่เมืองเพชร 2 ผล","60"},{a,"ทุเรียนกระดุม 100 กรัม","129"},
        {a,"ทุเรียนชะนี 100 กรัม","165"},{a,"น้อยหน่า 1/2 ผล","60"},{a,"ฝรั่ง 1/2 ผล","60"},{a,"ฝรั่งกลม (สาลี่) 1/2 ผล","60"},{a,"พุทรา 4 ผล","60"},
        {a,"มะกอกฝรั่ง 3 ผล","60"},{a,"มะขามหวาน 2 ฝัก","60"},{a,"มะขามเทศ 3 ฝัก","60"},{a,"มะปรางสุก 3 ผล","60"},{a,"มะม่วงน้ำดอกไม้สุก 4 ชิ้น","60"},
        {a,"มะม่วงอกร่องสุก 4 ชิ้น","60"},{a,"มะม่วงเขียวเสวย 1/2 ผล","60"},{a,"มะยม 15 ผล","30"},{a,"มะละกอ 8 ชิ้นพอคำ","60"},{a,"มะเฟือง 1/2 ผล","60"},
        {a,"มะไฟ 15 ผล","60"},{a,"มังคุด 4 ผล","60"},{a,"ระกำ 4 ผล","30"},{a,"ลองกอง 10 ผล","60"},{a,"ละมุด 1 1/2 ผล","60"},{a,"ลางสาด 10 ผล","60"},
        {a,"ลำไย 4 ผล","60"},{a,"ลิ้นจี่ 4 ผล","60"},{a,"ลูกตาลอ่อน 1 1/2 ผล","60"},{a,"ลูกพลับ 1/2 ผล","60"},{a,"ลูกเกด 15 เม็ด","60"},{a,"สตรอวเบอร์รี่ 6 ผล","60"},
        {a,"สละ (หวาน) 3 ผล","30"},{a,"สับปะรด 8 ชิ้นพอคำ","60"},{a,"สาลี่หอม 1 ผล","60"},{a,"ส้มเขียวหวาน 1 ผล","60"},{a,"ส้มเช้ง 1 ผล","60"},
        {a,"ส้มแป้น 1 กิโลกรัม","340"},{a,"ส้มโอ 1 กลีบ","60"},{a,"องุ่น (หวาน) 15 ผล","60"},{a,"องุ่น (เปรี้ยวอมหวาน) 20 ผล","60"},{a,"อ้อยควั่น 5 ชิ้น","60"},
        {a,"เงาะ 4 ผล","60"},{a,"เชอรี่ (มาราชิโน) 4 ผล","60"},{a,"เนื้อมะพร้าวอ่อน 100 กรัม","77"},{a,"แก้วมังกร 8 ชิ้นพอคำ","60"},{a,"แคนตาลูป 8 ชิ้นพอคำ","30"},
        {a,"แตงโม 1 กิโลกรัม","250"},{a,"แตงโม 1 ชิ้นพอดีคำ 60 กรัม","15"},{a,"แตงไทย 8 ชิ้นพอคำ","30"},{a,"แอปเปิ้ล 1/2 ผล","60"}};
    private String d = "เครื่องดื่ม";
    private String drink[][] ={{d,"กาแฟร้อน 1 แก้ว","55"},{d,"กาแฟเย็น 1 แก้ว","115"},{d,"ชาดำเย็น 1 แก้ว","110"},{d,"ชามะนาว 1 แก้ว","100"},
        {d,"ชาร้อน 1 แก้ว","55"},{d,"ชาเขียว (รสหวาน) 1 แก้ว","120"},{d,"ชาเย็น 1 แก้ว","100"},{d,"ช็อคโกแลตร้อน 1 แก้ว","120"},{d,"ช็อคโกแลตเย็น 1 แก้ว","120"},
        {d,"นมจืด (250 cc) 1 กล่อง","160"},{d,"นมจืด (ไขมันต่ำ) 1 กล่อง","125"},{d,"นมจืด (ไม่มีไขมัน) 1 กล่อง","80"},{d,"นมถั่วเหลือง (หวานน้อย) 1 กล่อง","140"},
        {d,"นมปรุงแต่ง (รสหวาน) 1 กล่อง","200"},{d,"นมเปรี้ยว UHT รสผลไม้ (200 cc) 1 กล่อง","125"},{d,"นมเย็น 1 แก้ว","150"},
        {d,"น้ำกระเจี๊ยบ 1 แก้ว","120"},{d,"น้ำขิง (ขิงผงรสหวาน) 1 กล่อง","60"},{d,"น้ำจับเลี้ยง 1 แก้ว","100"},{d,"น้ำชาเขียว (250 ml) 1 กล่อง","70"},
        {d,"น้ำชาเขียวผสมน้ำผึ้ง (250 ml) 1 กล่อง","70"},{d,"น้ำนมข้าวโพด 1 แก้ว","80"},{d,"น้ำผลไม้รวม 1 กล่อง","100"},{d,"น้ำผักรวม 1 กล่อง","90"},
        {d,"น้ำฝรั่ง 100%(200 ml) 1 กล่อง","100"},{d,"น้ำมะตูม 1 แก้ว","120"},{d,"น้ำมะนาว 1 แก้ว","100"},{d,"น้ำมะพร้าว 1 แก้ว","120"},
        {d,"น้ำมะพร้าวผสมเนื้อ 1 กล่อง","150"},{d,"น้ำมะเขือเทศ 1 แก้ว","48"},{d,"น้ำมะเขือเทศ100%(200 ml) 1 กล่อง","50"},{d,"น้ำลำใย 1 แก้ว","100"},
        {d,"น้ำสับปะรด 1 แก้ว","125"},{d,"น้ำสัปปะรด 100%(200 ml) 1 กล่อง","100"},{d,"น้ำส้ม 100%(200 ml) 1 กล่อง","120"},{d,"น้ำส้มคั้น 1 แก้ว","90"},
        {d,"น้ำองุ่น 1 แก้ว","112"},{d,"น้ำองุ่นแดง 100%(200 ml) 1 กล่อง","120"},{d,"น้ำอัดลม (หวาน) 1 แก้ว","75"},{d,"น้ำอัดลมประเภทโคล่า(325 cc) 1 กระป๋อง","130"},
        {d,"น้ำอ้อย 1/2 แก้ว","120"},{d,"น้ำเต้าหู้(จืด) 1 แก้ว","75"},{d,"น้ำแอปเปิ้ลแดง 100%(200 ml) 1 กล่อง","120"},{d,"น้ำใบบัวบก 1 แก้ว","120"},
        {d,"น้ำใบเตย 1 แก้ว","120"},{d,"บรั่นดี (60 cc) 1 แก้ว","130"},{d,"มิลค์เชค 1 แก้ว","150"},{d,"วอดก้า 60 cc","120"},{d,"วิสกี้ 60 cc","140"},
        {d,"เบียร์ไทย 1 แก้ว","148"},{d,"เหล้ายิน 60 cc","120"},{d,"เหล้ารัม 60 cc","120"},{d,"แม่โขง (45 cc) 1 แก้ว","43"},{d,"โกโก้ 1 แก้ว","210"},
        {d,"โยเกิร์ต (รสธรรมชาติ) 1 กล่อง","95"},{d,"โยเกิร์ต (รสผลไม้) 1 กล่อง","175"},{d,"โยเกิร์ต (ไขมันต่ำรสผลไม้) 1 กล่อง","160"},{d,"โอวัลติน 1 แก้ว","210"},
        {d,"โอวัลติน 1 แก้ว","165"},{d,"ไวน์เชอรี่ 60 cc","84"},{d,"ไวน์แชมเปญ 60 cc","42"}};
    private String o = "อื่นๆ";
    private String other[][] ={{o,"กระจับต้ม 70 กรัม","80"},{o,"ข้าวโอ๊ตสุก 1 ถ้วยตวง","130"},{o,"ครีมเทียม 1 ช้อนชา","45"},{o,"คอร์นเฟลค 1 ถ้วยตวง","110"},{o,"งาขาว 100 กรัม","628"},{o,"งาดำ 100 กรัม","593"},{o,"ถั่วดำดิบ 100 กรัม","332"},{o,"ถั่วลิสงดิบ 100 กรัม","530"},{o,"ถั่วเขียวดิบ 100 กรัม","329"},{o,"ถั่วเหลืองดิบ 100 กรัม","411"},{o,"ถั่วแขก 100 กรัม","366"},{o,"ถั่วแดงดิบ 100 กรัม","315"},{o,"น้ำตาลทราย 1 ช้อนชา","20"},{o,"มาการีน 1 ช้อนชา","45"},{o,"ลูกเดือย 100 กรัม","365"},{o,"สังขยา(ทาขนมปัง) 1 ช้อนชา","20"},{o,"หัวกะทิ 1 ช้อนชา","45"},{o,"เกาลัดคั่ว 100 กรัม","246"},{o,"เกาลัดจีน 4 เม็ดใหญ่ 35 กรัม","80"},{o,"เต้าหู้ขาวอ่อน 1 หลอด","110"},{o,"เต้าหู้เหลือง 1 อัน","90"},{o,"เต้าเจี้ยวขาว 100 กรัม","117"},{o,"เนย 1 ช้อนชา","45"},{o,"เนื้อมะพร้าวแก่ 100 กรัม","312"},{o,"เมล็ดบัวนึ่ง 100 กรัม","157"},{o,"เม็ดมะม่วงหิมพานต์ 100 กรัม","493"},{o,"แยม 1 ช้อนชา","20"},{o,"ไข่ไก่-ไข่เป็ด 1 ฟอง","84"}};
    private String e = "ออกกำลังกาย";
    private String exixe[][] ={{e,"กรรเชียงเรือด้วยความเร็ว 17.6กม./ชม.","970"},{e,"กรรเชียงเรือด้วยความเร็ว 5.6กม./ชม.","660"},{e,"กระโดดเชือก","780"},{e,"การเต้น Zumba","500"},{e,"ขี่จักรยาน","250-600"},{e,"ขี่จักรยานด้วยความเร็ว 14.4กม./ชม.","415"},{e,"ขี่จักรยานด้วยความเร็ว 20.0กม./ชม.","660"},{e,"ตีกอล์ฟ ลากถุงกอล์ฟ","300"},{e,"ตีกอล์ฟ แบกถุงกอล์ฟเอง","360"},{e,"ตีกอล์ฟ, นั่งรถ","240"},{e,"บาสเก็ตบอล","360-600"},{e,"มวยไทย","800"},{e,"วิ่งบนทางราบด้วยความเร็ว 12.8กม./ชม.","825"},{e,"วิ่งบนทางราบด้วยความเร็ว 18.2กม./ชม.","1390"},{e,"วิ่งเร็ว","900-1200"},{e,"วิ่งเหยาะๆ","600-750"},{e,"ว่ายน้ำ","260-750"},{e,"ว่ายน้ำด้วยความเร็ว 2.56กม./ชม.","700"},{e,"ว่ายน้ำด้วยความเร็ว 3.00กม./ชม.","850"},{e,"เดินขึ้นบันได","600-1080"},{e,"เดินขึ้นเนิน","480-900"},{e,"เดินช้า","150"},{e,"เดินธรรมดา","300"},{e,"เดินลงบันได","425"},{e,"เดินลงเนิน","240"},{e,"เดินเร็ว","420-480"},{e,"เต้นรำ","350"},{e,"เล่นวอลเล่ย์บอล","300"},{e,"เล่นสเก็ตปกติ","420"},{e,"เล่นสเก็ตแข่งความเร็ว","700"},{e,"เล่นฮูล่าฮูป","430"},{e,"เล่นเทนนิสคู่","360"},{e,"เล่นเทนนิสเดี่ยว","480"},{e,"เล่นแบดมินตัน","350"},{e,"เล่นโบว์ลิ่ง","400"},{e,"แอโรบิค","600"}};
    private String k = "กิจกรรม";
    private String exixaxi[][] ={{k,"กวาดพื้น","225"},{k,"ซักผ้าด้วยมือ","240"},{k,"ตัดหญ้า","250-300"},{k,"ทำงานบ้าน","150-250"},{k,"ทำสวน","300-450"},{k,"นอนหลับ","75"},{k,"นั่งดูทีวี","100"},{k,"นั่งทำงานใช้สมอง","110"},{k,"ปูที่นอน","135"},{k,"ยืน","140"},{k,"รีดผ้า","150"},{k,"ลงนอน (ไม่หลับ)","85"},{k,"เดินเล่น","210"},{k,"เย็บผ้า","115"},{k,"เลื่อยไม้","515"}};
    public table_food() {
        initComponents();
    }

    /**
     * This method is called from within the constructor to initialize the form.
     * WARNING: Do NOT modify this code. The content of this method is always
     * regenerated by the Form Editor.
     */
    @SuppressWarnings("unchecked")
    // <editor-fold defaultstate="collapsed" desc="Generated Code">//GEN-BEGIN:initComponents
    private void initComponents() {

        buttonGroup1 = new javax.swing.ButtonGroup();
        jComboBox1 = new javax.swing.JComboBox();
        jScrollPane1 = new javax.swing.JScrollPane();
        jTable1 = new javax.swing.JTable();
        jRadioButton1 = new javax.swing.JRadioButton();
        jRadioButton2 = new javax.swing.JRadioButton();
        jLabel1 = new javax.swing.JLabel();

        setClosable(true);
        setIconifiable(true);

        jComboBox1.setModel(new javax.swing.DefaultComboBoxModel(new String[] { "คลิกเพื่อเลือก......" }));
        jComboBox1.addActionListener(new java.awt.event.ActionListener() {
            public void actionPerformed(java.awt.event.ActionEvent evt) {
                jComboBox1ActionPerformed(evt);
            }
        });

        jTable1.setFont(new java.awt.Font("Tahoma", 0, 12)); // NOI18N
        jTable1.setModel(new javax.swing.table.DefaultTableModel(
            new Object [][] {
                {null, null, null},
                {null, null, null},
                {null, null, null},
                {null, null, null}
            },
            new String [] {
                "ประเภท", "อาหาร", "กิโลแคลอรี่"
            }
        ));
        jScrollPane1.setViewportView(jTable1);

        buttonGroup1.add(jRadioButton1);
        jRadioButton1.setText("แคลอรี่ในอาหาร");
        jRadioButton1.addActionListener(new java.awt.event.ActionListener() {
            public void actionPerformed(java.awt.event.ActionEvent evt) {
                jRadioButton1ActionPerformed(evt);
            }
        });

        buttonGroup1.add(jRadioButton2);
        jRadioButton2.setText("กิจกรรมการเผาผลาญแคลอรี่");
        jRadioButton2.addActionListener(new java.awt.event.ActionListener() {
            public void actionPerformed(java.awt.event.ActionEvent evt) {
                jRadioButton2ActionPerformed(evt);
            }
        });

        jLabel1.setText("เลือกค่าแคลอรี่");

        javax.swing.GroupLayout layout = new javax.swing.GroupLayout(getContentPane());
        getContentPane().setLayout(layout);
        layout.setHorizontalGroup(
            layout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addComponent(jComboBox1, 0, javax.swing.GroupLayout.DEFAULT_SIZE, Short.MAX_VALUE)
            .addComponent(jScrollPane1, javax.swing.GroupLayout.DEFAULT_SIZE, 544, Short.MAX_VALUE)
            .addGroup(layout.createSequentialGroup()
                .addContainerGap()
                .addComponent(jLabel1, javax.swing.GroupLayout.PREFERRED_SIZE, 88, javax.swing.GroupLayout.PREFERRED_SIZE)
                .addGap(18, 18, 18)
                .addComponent(jRadioButton1)
                .addGap(18, 18, 18)
                .addComponent(jRadioButton2)
                .addContainerGap(javax.swing.GroupLayout.DEFAULT_SIZE, Short.MAX_VALUE))
        );
        layout.setVerticalGroup(
            layout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addGroup(layout.createSequentialGroup()
                .addContainerGap(20, Short.MAX_VALUE)
                .addGroup(layout.createParallelGroup(javax.swing.GroupLayout.Alignment.TRAILING)
                    .addGroup(layout.createParallelGroup(javax.swing.GroupLayout.Alignment.BASELINE)
                        .addComponent(jRadioButton1)
                        .addComponent(jRadioButton2))
                    .addComponent(jLabel1, javax.swing.GroupLayout.PREFERRED_SIZE, 26, javax.swing.GroupLayout.PREFERRED_SIZE))
                .addPreferredGap(javax.swing.LayoutStyle.ComponentPlacement.UNRELATED)
                .addComponent(jComboBox1, javax.swing.GroupLayout.PREFERRED_SIZE, 26, javax.swing.GroupLayout.PREFERRED_SIZE)
                .addPreferredGap(javax.swing.LayoutStyle.ComponentPlacement.UNRELATED)
                .addComponent(jScrollPane1, javax.swing.GroupLayout.PREFERRED_SIZE, 388, javax.swing.GroupLayout.PREFERRED_SIZE))
        );

        pack();
    }// </editor-fold>//GEN-END:initComponents

    private void jComboBox1ActionPerformed(java.awt.event.ActionEvent evt) {//GEN-FIRST:event_jComboBox1ActionPerformed
     
//        if(jRadioButton1.setAutoscrolls(isIcon))
        if(jComboBox1.getSelectedItem().equals(f)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(food,H));
        }
        if(jComboBox1.getSelectedItem().equals(s)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(dessert,H));
        }
        if(jComboBox1.getSelectedItem().equals(a)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(fruit,H));
        }
        if(jComboBox1.getSelectedItem().equals(d)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(drink,H));
        }
        if(jComboBox1.getSelectedItem().equals(o)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(other,H));
        }
        if(jComboBox1.getSelectedItem().equals(e)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(exixe,HS));
        }
        if(jComboBox1.getSelectedItem().equals(k)){
        jTable1.setModel(new javax.swing.table.DefaultTableModel(exixaxi,HS));
        }
    
        
        
        
    }//GEN-LAST:event_jComboBox1ActionPerformed

    private void jRadioButton2ActionPerformed(java.awt.event.ActionEvent evt) {//GEN-FIRST:event_jRadioButton2ActionPerformed
        jComboBox1.removeItem(o);
        jComboBox1.removeItem(d);
        jComboBox1.removeItem(a);
        jComboBox1.removeItem(s);
        jComboBox1.removeItem(f);
        jComboBox1.addItem(e);
        jComboBox1.addItem(k);
    }//GEN-LAST:event_jRadioButton2ActionPerformed

    private void jRadioButton1ActionPerformed(java.awt.event.ActionEvent evt) {//GEN-FIRST:event_jRadioButton1ActionPerformed
        jComboBox1.removeItem(e);
        jComboBox1.removeItem(k);
        jComboBox1.addItem(f);
            jComboBox1.addItem(s); 
            jComboBox1.addItem(a);
            jComboBox1.addItem(d);
            jComboBox1.addItem(o); 
    }//GEN-LAST:event_jRadioButton1ActionPerformed


    // Variables declaration - do not modify//GEN-BEGIN:variables
    private javax.swing.ButtonGroup buttonGroup1;
    private javax.swing.JComboBox jComboBox1;
    private javax.swing.JLabel jLabel1;
    private javax.swing.JRadioButton jRadioButton1;
    private javax.swing.JRadioButton jRadioButton2;
    private javax.swing.JScrollPane jScrollPane1;
    private javax.swing.JTable jTable1;
    // End of variables declaration//GEN-END:variables
}

